app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE (first_name LIKE '%Carlos%' OR last_name LIKE '%Carlos%' OR phone_number LIKE '%Carlos%')
SELECT "contacts".* FROM "contacts"
---
  def index
    if params[:search].present?
      @contacts = Contact.where("first_name LIKE :search OR last_name LIKE :search OR phone_number LIKE :search", search: "%#{params[:search]}%")
    else
      @contacts = Contact.all

INSERT INTO "contacts" ("first_name", "last_name", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Carlos"], ["last_name", "de Juan"], ["phone_number", "+34649344705"], ["created_at", "2023-07-16 18:52:43.887410"], ["updated_at", "2023-07-16 18:52:43.887410"]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "last_name" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["last_name", ""], ["updated_at", "2023-07-16 19:57:04.633331"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)